### Terraform Plan (dev)
```
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_project_iam_member.dbt_bq_data_editor will be created
  + resource "google_project_iam_member" "dbt_bq_data_editor" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:mtt-dev-dbt@sandbox-nonprd.iam.gserviceaccount.com"
      + project = "sandbox-nonprd"
      + role    = "roles/bigquery.dataEditor"
    }

  # google_project_iam_member.dbt_bq_job_user will be created
  + resource "google_project_iam_member" "dbt_bq_job_user" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:mtt-dev-dbt@sandbox-nonprd.iam.gserviceaccount.com"
      + project = "sandbox-nonprd"
      + role    = "roles/bigquery.jobUser"
    }

  # google_service_account.dbt will be created
  + resource "google_service_account" "dbt" {
      + account_id   = "mtt-dev-dbt"
      + disabled     = false
      + display_name = "dbt SA (dev)"
      + email        = "mtt-dev-dbt@sandbox-nonprd.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:mtt-dev-dbt@sandbox-nonprd.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "sandbox-nonprd"
      + unique_id    = (known after apply)
    }

  # google_storage_bucket.dbt_artifacts will be created
  + resource "google_storage_bucket" "dbt_artifacts" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "ASIA-NORTHEAST1"
      + name                        = "mtt-dev-dbt-artifacts"
      + project                     = "sandbox-nonprd"
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning {
          + enabled = true
        }

      + website (known after apply)
    }

  # google_storage_bucket.dbt_docs will be created
  + resource "google_storage_bucket" "dbt_docs" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "ASIA-NORTHEAST1"
      + name                        = "mtt-dev-dbt-docs"
      + project                     = "sandbox-nonprd"
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # google_storage_bucket_iam_member.dbt_artifacts_admin will be created
  + resource "google_storage_bucket_iam_member" "dbt_artifacts_admin" {
      + bucket = "mtt-dev-dbt-artifacts"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:mtt-dev-dbt@sandbox-nonprd.iam.gserviceaccount.com"
      + role   = "roles/storage.objectAdmin"
    }

  # google_storage_bucket_iam_member.dbt_docs_admin will be created
  + resource "google_storage_bucket_iam_member" "dbt_docs_admin" {
      + bucket = "mtt-dev-dbt-docs"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:mtt-dev-dbt@sandbox-nonprd.iam.gserviceaccount.com"
      + role   = "roles/storage.objectAdmin"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + artifacts_bucket_name = "mtt-dev-dbt-artifacts"
  + dbt_sa_email          = "mtt-dev-dbt@sandbox-nonprd.iam.gserviceaccount.com"
  + docs_bucket_name      = "mtt-dev-dbt-docs"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.dev

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.dev"

```